Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CD1G.atdf
        <register caption="Last Channel Compare Window Register" name="ADC_LCCWR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
          <bitfield caption="Overrun Error 8" mask="0x00000100" name="OVRE8"/>
          <bitfield caption="Overrun Error 9" mask="0x00000200" name="OVRE9"/>
          <bitfield caption="Overrun Error 10" mask="0x00000400" name="OVRE10"/>
          <bitfield caption="Overrun Error 11" mask="0x00000800" name="OVRE11"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Type" mask="0x00000004" name="CMPTYPE" values="ADC_EMR__CMPTYPE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Over Sampling Rate" mask="0x00030000" name="OSR" values="ADC_EMR__OSR"/>
          <bitfield caption="Averaging on Single Trigger Event" mask="0x00100000" name="ASTE" values="ADC_EMR__ASTE"/>
          <bitfield caption="External Clock Selection" mask="0x00200000" name="SRCCLK" values="ADC_EMR__SRCCLK"/>
          <bitfield caption="Tag of ADC_LCDR" mask="0x01000000" name="TAG"/>
          <bitfield caption="Sign Mode" mask="0x06000000" name="SIGNMODE" values="ADC_EMR__SIGNMODE"/>
          <bitfield caption="ADC Running Mode" mask="0x30000000" name="ADCMODE" values="ADC_EMR__ADCMODE"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00003FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x3FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Offset Register" name="ADC_COR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Differential Inputs for Channel 0" mask="0x00010000" name="DIFF0"/>
          <bitfield caption="Differential Inputs for Channel 1" mask="0x00020000" name="DIFF1"/>
          <bitfield caption="Differential Inputs for Channel 2" mask="0x00040000" name="DIFF2"/>
          <bitfield caption="Differential Inputs for Channel 3" mask="0x00080000" name="DIFF3"/>
          <bitfield caption="Differential Inputs for Channel 4" mask="0x00100000" name="DIFF4"/>
          <bitfield caption="Differential Inputs for Channel 5" mask="0x00200000" name="DIFF5"/>
          <bitfield caption="Differential Inputs for Channel 6" mask="0x00400000" name="DIFF6"/>
          <bitfield caption="Differential Inputs for Channel 7" mask="0x00800000" name="DIFF7"/>
          <bitfield caption="Differential Inputs for Channel 8" mask="0x01000000" name="DIFF8"/>
          <bitfield caption="Differential Inputs for Channel 9" mask="0x02000000" name="DIFF9"/>
          <bitfield caption="Differential Inputs for Channel 10" mask="0x04000000" name="DIFF10"/>
          <bitfield caption="Differential Inputs for Channel 11" mask="0x08000000" name="DIFF11"/>
        </register>
        <register caption="Channel Data Register" count="12" name="ADC_CDR" offset="0x50" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00003FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Pen Detection Sensitivity" mask="0x00000003" name="PENDETSENS"/>
          <bitfield caption="ADC Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="Touchscreen Mode Register" name="ADC_TSMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Touchscreen Mode" mask="0x00000003" name="TSMODE" values="ADC_TSMR__TSMODE"/>
          <bitfield caption="Touchscreen Average" mask="0x00000030" name="TSAV" values="ADC_TSMR__TSAV"/>
          <bitfield caption="Touchscreen Frequency" mask="0x00000F00" name="TSFREQ"/>
          <bitfield caption="Touchscreen Switches Closure Time" mask="0x000F0000" name="TSSCTIM"/>
          <bitfield caption="No TouchScreen DMA" mask="0x00400000" name="NOTSDMA"/>
          <bitfield caption="Pen Contact Detection Enable" mask="0x01000000" name="PENDET"/>
          <bitfield caption="Pen Detect Debouncing Period" mask="0xF0000000" name="PENDBC"/>
        </register>
        <register caption="Touchscreen X Position Register" name="ADC_XPOSR" offset="0xB4" rw="R" size="4">
          <bitfield caption="X Position" mask="0x00000FFF" name="XPOS"/>
          <bitfield caption="Scale of XPOS" mask="0x0FFF0000" name="XSCALE"/>
        </register>
        <register caption="Touchscreen Y Position Register" name="ADC_YPOSR" offset="0xB8" rw="R" size="4">
          <bitfield caption="Y Position" mask="0x00000FFF" name="YPOS"/>
          <bitfield caption="Scale of YPOS" mask="0x0FFF0000" name="YSCALE"/>
        </register>
        <register caption="Touchscreen Pressure Register" name="ADC_PRESSR" offset="0xBC" rw="R" size="4">
          <bitfield caption="Data of Z1 Measurement" mask="0x00000FFF" name="Z1"/>
          <bitfield caption="Data of Z2 Measurement" mask="0x0FFF0000" name="Z2"/>
        </register>
        <register caption="Trigger Register" name="ADC_TRGR" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Trigger Mode" mask="0x00000007" name="TRGMOD" values="ADC_TRGR__TRGMOD"/>
          <bitfield caption="Trigger Period" mask="0xFFFF0000" name="TRGPER"/>
        </register>
