Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CD1G.atdf
        <register caption="SPI Interrupt Enable Register" name="FLEX_SPI_IER" offset="0x414" rw="W" size="4" atomic-op="set:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Enable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="SPI Interrupt Disable Register" name="FLEX_SPI_IDR" offset="0x418" rw="W" size="4" atomic-op="clear:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Disable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="SPI Interrupt Mask Register" name="FLEX_SPI_IMR" offset="0x41C" rw="R" size="4" atomic-op="read:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Mask" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="SPI Chip Select Register" count="2" name="FLEX_SPI_CSR" offset="0x430" rw="RW" size="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="NCPHA"/>
          <bitfield caption="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" mask="0x00000004" name="CSNAAT"/>
          <bitfield caption="Chip Select Active After Transfer" mask="0x00000008" name="CSAAT"/>
          <bitfield caption="Bits Per Transfer" mask="0x000000F0" name="BITS" values="FLEX_SPI_CSR__BITS"/>
          <bitfield caption="Serial Clock Bit Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before SPCK" mask="0x00FF0000" name="DLYBS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0xFF000000" name="DLYBCT"/>
        </register>
        <register caption="SPI FIFO Mode Register" name="FLEX_SPI_FMR" offset="0x440" rw="RW" size="4">
          <bitfield caption="Transmit Data Register Empty Mode" mask="0x00000003" name="TXRDYM" values="FLEX_SPI_FMR__TXRDYM"/>
          <bitfield caption="Receive Data Register Full Mode" mask="0x00000030" name="RXRDYM" values="FLEX_SPI_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
