Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CD1G.atdf
        <register caption="Low-power DDR2 Low-power DDR3 Low-power Register" name="MPDDRC_LPDDR23_LPR" offset="0x28" rw="RW" size="4">
          <bitfield caption="Bank Mask Bit/PASR" mask="0x000000FF" name="BK_MASK_PASR"/>
          <bitfield caption="Segment Mask Bit" mask="0x00FFFF00" name="SEG_MASK"/>
          <bitfield caption="Drive Strength" mask="0x0F000000" name="DS" values="MPDDRC_LPDDR23_LPR__DS"/>
        </register>
        <register caption="Low-power DDR2 Low-power DDR3 and DDR3 Calibration and MR4 Register" name="MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4" offset="0x2C" rw="RW" size="4">
          <bitfield caption="LPDDR2 LPDDR3 and DDR3 Calibration Timer Count" mask="0x0000FFFF" name="COUNT_CAL"/>
          <bitfield caption="Mode Register 4 Read Interval" mask="0xFFFF0000" name="MR4_READ"/>
        </register>
        <register caption="Low-power DDR2 Low-power DDR3 and DDR3 Timing Calibration Register" name="MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL" offset="0x30" rw="RW" size="4">
          <bitfield caption="ZQ Calibration Short" mask="0x000000FF" name="ZQCS"/>
          <bitfield caption="Built-in Self-Test for RZQ Information (read-only)" mask="0x00030000" name="RZQI" values="MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL__RZQI"/>
        </register>
        <register caption="I/O Calibration Register" name="MPDDRC_IO_CALIBR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Resistor Divider, Output Driver Impedance" mask="0x00000007" name="RDIV" values="MPDDRC_IO_CALIBR__RDIV"/>
          <bitfield caption="Enable Calibration" mask="0x00000010" name="EN_CALIB" values="MPDDRC_IO_CALIBR__EN_CALIB"/>
          <bitfield caption="IO Calibration" mask="0x00007F00" name="TZQIO"/>
          <bitfield caption="Number of Transistor P (read-only)" mask="0x000F0000" name="CALCODEP"/>
          <bitfield caption="Number of Transistor N (read-only)" mask="0x00F00000" name="CALCODEN"/>
        </register>
        <register caption="OCMS Register" name="MPDDRC_OCMS" offset="0x38" rw="RW" size="4">
          <bitfield caption="Scrambling Enable" mask="0x00000001" name="SCR_EN"/>
        </register>
        <register caption="OCMS KEY1 Register" name="MPDDRC_OCMS_KEY1" offset="0x3C" rw="W" size="4">
          <bitfield caption="Off-chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="OCMS KEY2 Register" name="MPDDRC_OCMS_KEY2" offset="0x40" rw="W" size="4">
          <bitfield caption="Off-chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="Configuration Arbiter Register" name="MPDDRC_CONF_ARBITER" offset="0x44" rw="RW" size="4">
          <bitfield caption="Type of Arbitration" mask="0x00000003" name="ARB" values="MPDDRC_CONF_ARBITER__ARB"/>
          <bitfield caption="Bandwidth Max or Current" mask="0x00000008" name="BDW_MAX_CUR"/>
          <bitfield caption="Request or Word from Port X" mask="0x00000100" name="RQ_WD_P0"/>
          <bitfield caption="Request or Word from Port X" mask="0x00000200" name="RQ_WD_P1"/>
          <bitfield caption="Request or Word from Port X" mask="0x00000400" name="RQ_WD_P2"/>
          <bitfield caption="Request or Word from Port X" mask="0x00000800" name="RQ_WD_P3"/>
          <bitfield caption="Request or Word from Port X" mask="0x00001000" name="RQ_WD_P4"/>
          <bitfield caption="Request or Word from Port X" mask="0x00002000" name="RQ_WD_P5"/>
          <bitfield caption="Request or Word from Port X" mask="0x00004000" name="RQ_WD_P6"/>
          <bitfield caption="Request or Word from Port X" mask="0x00008000" name="RQ_WD_P7"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00010000" name="MA_PR_P0"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00020000" name="MA_PR_P1"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00040000" name="MA_PR_P2"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00080000" name="MA_PR_P3"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00100000" name="MA_PR_P4"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00200000" name="MA_PR_P5"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00400000" name="MA_PR_P6"/>
          <bitfield caption="Master or Software Provide Information" mask="0x00800000" name="MA_PR_P7"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x01000000" name="BDW_BURST_P0"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x02000000" name="BDW_BURST_P1"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x04000000" name="BDW_BURST_P2"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x08000000" name="BDW_BURST_P3"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x10000000" name="BDW_BURST_P4"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x20000000" name="BDW_BURST_P5"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x40000000" name="BDW_BURST_P6"/>
          <bitfield caption="Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X" mask="0x80000000" name="BDW_BURST_P7"/>
        </register>
        <register caption="Timeout Register" name="MPDDRC_TIMEOUT" offset="0x48" rw="RW" size="4">
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x0000000F" name="TIMEOUT_P0"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x000000F0" name="TIMEOUT_P1"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x00000F00" name="TIMEOUT_P2"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x0000F000" name="TIMEOUT_P3"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x000F0000" name="TIMEOUT_P4"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x00F00000" name="TIMEOUT_P5"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0x0F000000" name="TIMEOUT_P6"/>
          <bitfield caption="Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7" mask="0xF0000000" name="TIMEOUT_P7"/>
        </register>
        <register caption="Request Port 0-1-2-3 Register" name="MPDDRC_REQ_PORT_0123" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3" mask="0x000000FF" name="NRQ_NWD_BDW_P0"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3" mask="0x0000FF00" name="NRQ_NWD_BDW_P1"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3" mask="0x00FF0000" name="NRQ_NWD_BDW_P2"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3" mask="0xFF000000" name="NRQ_NWD_BDW_P3"/>
        </register>
        <register caption="Request Port 4-5-6-7 Register" name="MPDDRC_REQ_PORT_4567" offset="0x50" rw="RW" size="4">
          <bitfield caption="Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7" mask="0x000000FF" name="NRQ_NWD_BDW_P4"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7" mask="0x0000FF00" name="NRQ_NWD_BDW_P5"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7" mask="0x00FF0000" name="NRQ_NWD_BDW_P6"/>
          <bitfield caption="Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7" mask="0xFF000000" name="NRQ_NWD_BDW_P7"/>
        </register>
        <register caption="Current/Maximum Bandwidth Port 0-1-2-3 Register" name="MPDDRC_BDW_PORT_0123" offset="0x54" rw="R" size="4">
          <bitfield caption="Current/Maximum Bandwidth from Port 0-1-2-3" mask="0x0000007F" name="BDW_P0"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 0-1-2-3" mask="0x00007F00" name="BDW_P1"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 0-1-2-3" mask="0x007F0000" name="BDW_P2"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 0-1-2-3" mask="0x7F000000" name="BDW_P3"/>
        </register>
        <register caption="Current/Maximum Bandwidth Port 4-5-6-7 Register" name="MPDDRC_BDW_PORT_4567" offset="0x58" rw="R" size="4">
          <bitfield caption="Current/Maximum Bandwidth from Port 4-5-6-7" mask="0x0000007F" name="BDW_P4"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 4-5-6-7" mask="0x00007F00" name="BDW_P5"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 4-5-6-7" mask="0x007F0000" name="BDW_P6"/>
          <bitfield caption="Current/Maximum Bandwidth from Port 4-5-6-7" mask="0x7F000000" name="BDW_P7"/>
        </register>
        <register caption="Read Data Path Register" name="MPDDRC_RD_DATA_PATH" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Shift Sampling Point of Data" mask="0x00000003" name="SHIFT_SAMPLING" values="MPDDRC_RD_DATA_PATH__SHIFT_SAMPLING"/>
        </register>
