Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CD1G.atdf
      <value-group caption="Command End Bit Error Signal Enable" name="SDMMC_EISIER_E_MMC__CMDEND">
        <value caption="No interrupt is generated when the CMDEND status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDEND status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Signal Enable" name="SDMMC_EISIER_E_MMC__CMDIDX">
        <value caption="No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Signal Enable" name="SDMMC_EISIER_E_MMC__DATTEO">
        <value caption="No interrupt is generated when the DATTEO status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATTEO status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Signal Enable" name="SDMMC_EISIER_E_MMC__DATCRC">
        <value caption="No interrupt is generated when the DATCRC status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATCRC status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Signal Enable" name="SDMMC_EISIER_E_MMC__DATEND">
        <value caption="No interrupt is generated when the DATEND status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATEND status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Signal Enable" name="SDMMC_EISIER_E_MMC__CURLIM">
        <value caption="No interrupt is generated when the CURLIM status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CURLIM status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto CMD Error Signal Enable" name="SDMMC_EISIER_E_MMC__ACMD">
        <value caption="No interrupt is generated when the ACMD status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the ACMD status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Signal Enable" name="SDMMC_EISIER_E_MMC__ADMA">
        <value caption="No interrupt is generated when the ADMA status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the ADMA status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Error Signal Enable" name="SDMMC_EISIER_E_MMC__BOOTAE">
        <value caption="No interrupt is generated when the BOOTAE status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BOOTAE status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="UHS Mode Select" name="SDMMC_HC2R__UHSMS">
        <value caption="UHS SDR12 Mode" name="SDR12" value="0x0"/>
        <value caption="UHS SDR25 Mode" name="SDR25" value="0x1"/>
        <value caption="UHS SDR50 Mode" name="SDR50" value="0x2"/>
        <value caption="UHS SDR104 Mode" name="SDR104" value="0x3"/>
        <value caption="UHS DDR50 Mode" name="DDR50" value="0x4"/>
      </value-group>
      <value-group caption="Driver Strength Select" name="SDMMC_HC2R__DRVSEL">
        <value caption="Driver Type B is selected (Default)" name="TYPEB" value="0x0"/>
        <value caption="Driver Type A is selected" name="TYPEA" value="0x1"/>
        <value caption="Driver Type C is selected" name="TYPEC" value="0x2"/>
        <value caption="Driver Type D is selected" name="TYPED" value="0x3"/>
      </value-group>
      <value-group caption="Driver Strength Select" name="SDMMC_HC2R_E_MMC__DRVSEL">
        <value caption="Driver Type B is selected (Default)" name="TYPEB" value="0x0"/>
        <value caption="Driver Type A is selected" name="TYPEA" value="0x1"/>
        <value caption="Driver Type C is selected" name="TYPEC" value="0x2"/>
        <value caption="Driver Type D is selected" name="TYPED" value="0x3"/>
      </value-group>
      <value-group caption="Max Block Length" name="SDMMC_CA0R__MAXBLKL">
        <value caption="512 bytes" name="_512" value="0x0"/>
        <value caption="1024 bytes" name="_1024" value="0x1"/>
        <value caption="2048 bytes" name="_2048" value="0x2"/>
      </value-group>
      <value-group caption="Retuning Modes" name="SDMMC_CA1R__RTMOD">
        <value caption="Timer" name="MODE1" value="0x0"/>
        <value caption="Timer and Retuning Request" name="MODE2" value="0x1"/>
        <value caption="Auto Retuning (for transfer) Timer and Retuning Request" name="MODE3" value="0x2"/>
      </value-group>
      <value-group caption="e.MMC Command Type" name="SDMMC_MC1R__CMDTYP">
        <value caption="The command is not an e.MMC specific command." name="NORMAL" value="0x0"/>
        <value caption="This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). Refer to &quot;Interrupt Mode&quot; in the &quot;Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51&quot; ." name="WAITIRQ" value="0x1"/>
        <value caption="This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41." name="STREAM" value="0x2"/>
        <value caption="Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device." name="BOOT" value="0x3"/>
      </value-group>
      <value-group caption="AHB Maximum Burst" name="SDMMC_ACR__BMAX">
        <value caption="The maximum burst size is INCR16." name="INCR16" value="0x0"/>
        <value caption="The maximum burst size is INCR8." name="INCR8" value="0x1"/>
        <value caption="The maximum burst size is INCR4." name="INCR4" value="0x2"/>
        <value caption="Only SINGLE transfers are performed." name="SINGLE" value="0x3"/>
      </value-group>
      <value-group caption="Retuning Timer Enable" name="SDMMC_RTC1R__TMREN">
        <value caption="The retuning timer is disabled." name="DISABLED" value="0"/>
        <value caption="The retuning timer is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Retuning Timer Event" name="SDMMC_RTISTER__TEVT">
        <value caption="The TEVT status flag in SDMMC_RTISTR is masked." name="MASKED" value="0"/>
        <value caption="The TEVT status flag in SDMMC_RTISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Retuning Timer Event" name="SDMMC_RTISIER__TEVT">
        <value caption="No interrupt is generated when the TEVT status rises in SDMMC_RTISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the TEVT status rises in SDMMC_RTISTR." name="ENABLED" value="1"/>
      </value-group>
    </module>
    <module caption="Security Module" id="44107" name="SECUMOD" version="B">
      <register-group name="SECUMOD">
        <register caption="Control Register" name="SECUMOD_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Backup Mode" mask="0x00000001" name="BACKUP"/>
          <bitfield caption="Normal Mode" mask="0x00000002" name="NORMAL"/>
          <bitfield caption="Software Protection" mask="0x00000004" name="SWPROT"/>
          <bitfield caption="Memory Scrambling Enable" mask="0x00000600" name="SCRAMB"/>
          <bitfield caption="Password" mask="0xFFFF0000" name="KEY"/>
        </register>
