Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CD1G.atdf
        <register caption="PMECC Remainder 3 Register (sec_num = 0)" name="HSMC_REM3_" offset="0xC" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 0)" name="HSMC_REM4_" offset="0x10" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 0)" name="HSMC_REM5_" offset="0x14" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 0)" name="HSMC_REM6_" offset="0x18" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 0)" name="HSMC_REM7_" offset="0x1C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 0)" name="HSMC_REM8_" offset="0x20" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 0)" name="HSMC_REM9_" offset="0x24" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 10 Register (sec_num = 0)" name="HSMC_REM10_" offset="0x28" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 0)" name="HSMC_REM11_" offset="0x2C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 12 Register (sec_num = 0)" name="HSMC_REM12_" offset="0x30" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 13 Register (sec_num = 0)" name="HSMC_REM13_" offset="0x34" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 14 Register (sec_num = 0)" name="HSMC_REM14_" offset="0x38" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 15 Register (sec_num = 0)" name="HSMC_REM15_" offset="0x3C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
      </register-group>
      <register-group name="SMC">
        <register caption="NFC Configuration Register" name="HSMC_CFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="Page Size of the NAND Flash Device" mask="0x00000007" name="PAGESIZE" values="HSMC_CFG__PAGESIZE"/>
          <bitfield caption="Write Spare Area" mask="0x00000100" name="WSPARE"/>
          <bitfield caption="Read Spare Area" mask="0x00000200" name="RSPARE"/>
          <bitfield caption="Rising/Falling Edge Detection Control" mask="0x00001000" name="EDGECTRL"/>
          <bitfield caption="Ready/Busy Signal Edge Detection" mask="0x00002000" name="RBEDGE"/>
          <bitfield caption="Data Timeout Cycle Number" mask="0x000F0000" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00700000" name="DTOMUL" values="HSMC_CFG__DTOMUL"/>
          <bitfield caption="NAND Flash Spare Area Size Retrieved by the Host Controller" mask="0x7F000000" name="NFCSPARESIZE"/>
        </register>
        <register caption="NFC Control Register" name="HSMC_CTRL" offset="0x004" rw="W" size="4">
          <bitfield caption="NAND Flash Controller Enable" mask="0x00000001" name="NFCEN"/>
          <bitfield caption="NAND Flash Controller Disable" mask="0x00000002" name="NFCDIS"/>
        </register>
        <register caption="NFC Status Register" name="HSMC_SR" offset="0x008" rw="R" size="4">
          <bitfield caption="NAND Flash Controller Status (this field cannot be reset)" mask="0x00000001" name="SMCSTS"/>
          <bitfield caption="Selected Ready Busy Rising Edge Detected" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Selected Ready Busy Falling Edge Detected" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="NFC Busy (this field cannot be reset)" mask="0x00000100" name="NFCBUSY"/>
          <bitfield caption="NFC Write/Read Operation (this field cannot be reset)" mask="0x00000800" name="NFCWR"/>
          <bitfield caption="NFC Chip Select ID (this field cannot be reset)" mask="0x00007000" name="NFCSID"/>
          <bitfield caption="NFC Data Transfer Terminated" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Error" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Edge Detected" mask="0x01000000" name="RB_EDGE0"/>
        </register>
